[{:id "level3",
  :name "Уровень 3",
  :accept true,
  :users
  [{:name "Лаптев Анатолий", :mccme 218604}
   {:name "Лучинин Сергей", :mccme 227614}
   {:name "Лучинин Алексей", :mccme 277999}
   {:name "Семенова Мария", :mccme 233828}
   {:name "Рублев Богдан", :mccme 213513}
   {:name "Шушпанов Стефан", :mccme 204109}
   {:name "Шушпанов Елисей", :mccme 204110}
   {:name "Гнусов Александр", :mccme 259544}
   {:name "Горшунова Марина", :mccme 238821}
   {:name "Бушмаков Максим", :mccme 241328}
   {:name "Марданов Сергей", :mccme 207524}
   {:name "Клёпов Дмитрий", :mccme 217204}
   {:name "Шамов Степан", :mccme 217625}
   {:name "Фукалов Даниил", :mccme 184493}
   {:name "Санников Илья", :mccme 204550}
   {:name "Лучинин Сергей", :mccme 227614}
   {:name "Барышева Настя", :mccme 238355}],
  :contests
  [{:name "ДП - 3.1",
    :problems
    [{:mccme 3005,
      :name "Количество правильных скобочных последовательностей"}
     {:mccme 208, :name "Восстановление скобок"}
     {:mccme 3001, :name "Пилообразные последовательности"}
     {:mccme 1906, :name "Распил брусьев"}
     {:mccme 3130, :name "Длина максимального подпалиндрома"}
     {:mccme 1124, :name "Максимальный подпалиндром"}]}
   {:name "ДП - 3.2",
    :problems
    [{:mccme 1141, :name "Нечестная игра"}
     {:mccme 515, :name "Словарь"}
     {:mccme 1229, :name "Кафе"}
     {:mccme 1905, :name "Удаление скобок"}
     {:mccme 1777, :name "Экспериментатор"}]}
   {:name "Рекурсия",
    :problems
    [{:mccme 87,
      :name
      "Все возрастающие последовательности длины k из чисел 1..n"}
     {:mccme 84,
      :name "Все двоичные строки длины n, содержащие ровно k единиц"}
     {:mccme 90,
      :name "Разбиение на невозрастающие слагаемые, обратный порядок"}
     {:mccme 111722, :name "Задача о рюкзаке"}
     {:mccme 612, :name "Выражение"}
     {:mccme 636, :name "Скобки(2)"}]}]}
 {:id "level2",
  :name "Уровень 2",
  :accept true,
  :users
  [{:name "Лаптев Анатолий", :mccme 218604}
   {:name "Лучинин Сергей", :mccme 227614}
   {:name "Лучинин Алексей", :mccme 277999}
   {:name "Семенова Мария", :mccme 233828}
   {:name "Рублев Богдан", :mccme 213513}
   {:name "Шушпанов Стефан", :mccme 204109}
   {:name "Шушпанов Елисей", :mccme 204110}
   {:name "Гнусов Александр", :mccme 259544}
   {:name "Горшунова Марина", :mccme 238821}
   {:name "Бушмаков Максим", :mccme 241328}
   {:name "Марданов Сергей", :mccme 207524}
   {:name "Клёпов Дмитрий", :mccme 217204}
   {:name "Шамов Степан", :mccme 217625}
   {:name "Фукалов Даниил", :mccme 184493}
   {:name "Санников Илья", :mccme 204550}
   {:name "Лучинин Сергей", :mccme 227614}
   {:name "Барышева Настя", :mccme 238355}],
  :contests
  [{:name "Теория чисел",
    :problems
    [{:mccme 199, :name "НОД"}
     {:mccme 27, :name "Сокращение дроби"}
     {:mccme 1838, :name "Отрезок"}
     {:mccme 1037, :name "Представление чисел"}
     {:mccme 152, :name "Гипотеза Гольдбаха"}
     {:mccme 404, :name "Кинотеатр"}
     {:mccme 1453, :name "Полярные единички"}
     {:mccme 1009, :name "Степень"}]}
   {:name "Очереди, стеки",
    :problems
    [{:mccme 50, :name "Игра в пьяницу"}
     {:mccme 51, :name "Правильная скобочная последовательность"}
     {:mccme 52, :name "Постфиксная запись"}
     {:mccme 161, :name "Один конь"}
     {:mccme 200, :name "Площадь комнаты"}
     {:mccme 3569, :name "Хорошие дни"}]}
   {:name "Сортировка",
    :problems
    [{:mccme 1446, :name "Результаты олимпиады"}
     {:mccme 111162, :name "Такси"}
     {:mccme 3356, :name "Минимальное покрытие"}
     {:mccme 3721, :name "Кассы"}]}
   {:name "Двоичный поиск",
    :problems
    [{:mccme 4, :name "Двоичный поиск"}
     {:mccme 111404, :name "Мутанты"}
     {:mccme 112749, :name "Вырубка леса"}
     {:mccme 113097, :name "Космическое поселение"}
     {:mccme 672, :name "Провода"}
     {:mccme 1, :name "Коровы - в стойла"}]}
   {:name "ДП",
    :problems
    [{:mccme 2999, :name "Ход коня"}
     {:mccme 2963, :name "Калькулятор"}
     {:mccme 1119, :name "0-1 рюкзак: наибольший вес"}
     {:mccme 205,
      :name "Наибольшая возрастающая подпоследовательность (НВП)"}
     {:mccme 1790,
      :name
      "Наибольшая общая подпоследовательность с восстановлением ответа"}
     {:mccme 1791, :name "Расстояние по Левенштейну"}
     {:mccme 3003, :name "Разбиения на слагаемые"}]}]}
 {:id "python",
  :name "Питон",
  :accept true,
  :users
  [{:name "Лаптев Анатолий", :mccme 218604}
   {:name "Шушпанов Елисей", :mccme 204110}
   {:name "Бушмаков Максим", :mccme 241328}
   {:name "Копанев Андрей", :mccme 296703}
   {:name "Марданов Сергей", :mccme 207524}],
  :contests
  [{:name "Типы данных, целочисленная арифметика",
    :problems
    [{:mccme 3443, :name "Степень двойки."}
     {:mccme 3444, :name "Факториал."}
     {:mccme 3445, :name "Гипотенуза."}
     {:mccme 3450, :name "Квадрат числа."}
     {:mccme 3451, :name "Корень степени 10."}
     {:mccme 3455, :name "Гипотенуза"}
     {:mccme 3456, :name "Hello, Harry!"}
     {:mccme 3461, :name "Последняя цифра"}
     {:mccme 3464, :name "Сумма цифр"}
     {:mccme 3466, :name "Шнурки"}
     {:mccme 3468, :name "Электронные часы - 1"}
     {:mccme 3473, :name "Стоимость покупки"}
     {:mccme 3477, :name "Улитка"}
     {:mccme 3535, :name "Пингвины"}]}
   {:name "Условный оператор, цикл for",
    :problems
    [{:mccme 3501, :name "Максимум двух чисел"}
     {:mccme 3502, :name "Какое число больше?"}
     {:mccme 3504, :name "Високосный год"}
     {:mccme 3505, :name "Максимум трех чисел"}
     {:mccme 3507, :name "Сколько совпадает чисел"}
     {:mccme 3510, :name "Ход короля"}
     {:mccme 3512, :name "Ход ферзя"}
     {:mccme 3513, :name "Ход коня"}
     {:mccme 3514, :name "Шахматная доска"}
     {:mccme 3520, :name "Билеты на метро - 1"}
     {:mccme 3523, :name "Коробки"}
     {:mccme 3526, :name "Котлеты"}
     {:mccme 3528, :name "Ряд - 1"}
     {:mccme 3530, :name "Ряд - 3"}
     {:mccme 3531, :name "Сумма квадратов"}
     {:mccme 3532, :name "Сумма кубов"}
     {:mccme 3534, :name "Число сочетаний"}
     {:mccme 3536, :name "Флаги"}
     {:mccme 3539, :name "Сумма десяти чисел"}
     {:mccme 3540, :name "Сумма N чисел"}
     {:mccme 3544, :name "Замечательные числа - 1"}
     {:mccme 3545, :name "Замечательные числа - 2"}
     {:mccme 3546, :name "Замечательные числа - 3"}
     {:mccme 3548, :name "Замечательные числа - 4"}
     {:mccme 3549, :name "Замечательные числа - 5"}
     {:mccme 3553, :name "Потерянная карточка"}]}
   {:name "Строки и списки",
    :problems
    [{:mccme 3737, :name "Две половинки"}
     {:mccme 3741, :name "Удаление фрагмента"}
     {:mccme 3742, :name "Обращение фрагмента"}
     {:mccme 3743, :name "Дублирование фрагмента"}
     {:mccme 3744, :name "Замена подстроки"}
     {:mccme 3828, :name "Четные индексы"}
     {:mccme 3829, :name "Четные элементы"}
     {:mccme 3832, :name "Соседи одного знака"}
     {:mccme 3833, :name "Больше своих соседей"}
     {:mccme 3834, :name "Наибольший элемент"}
     {:mccme 3837, :name "Шеренга"}
     {:mccme 3838, :name "Количество различных элементов"}
     {:mccme 3843, :name "Переставить min и max"}
     {:mccme 3846, :name "Количество совпадающих пар"}
     {:mccme 3847, :name "Уникальные элементы"}
     {:mccme 3851, :name "Кегельбан"}
     {:mccme 3852, :name "Ферзи"}]}
   {:name "Словари, множества, двумерные массивы",
    :problems
    [{:mccme 3749, :name "Количество различных чисел"}
     {:mccme 3751, :name "Пересечение множеств"}
     {:mccme 3752, :name "Встречалось ли число раньше"}
     {:mccme 3754, :name "Количество слов в тексте"}
     {:mccme 3757, :name "Полиглоты"}
     {:mccme 3760, :name "Словарь синонимов"}
     {:mccme 3762, :name "Самое частое слово"}
     {:mccme 3764, :name "Частотный анализ"}
     {:mccme 3767, :name "Англо-латинский словарь"}
     {:mccme 3769, :name "Продажи (D)"}
     {:mccme 111364, :name "Шахматная доска"}
     {:mccme 111366, :name "Побочная диагональ"}
     {:mccme 111373, :name "Кинотеатр"}
     {:mccme 111377, :name "Ходы ферзя"}
     {:mccme 111385, :name "Сапер"}]}]}
 {:id "e1",
  :name "Питон",
  :accept true,
  :users [{:name "Пестов Евгений", :mccme 289122}],
  :contests
  [{:name "Типы данных, целочисленная арифметика",
    :problems
    [{:mccme 3443, :name "Степень двойки."}
     {:mccme 3444, :name "Факториал."}
     {:mccme 3445, :name "Гипотенуза."}
     {:mccme 3450, :name "Квадрат числа."}
     {:mccme 3451, :name "Корень степени 10."}
     {:mccme 3455, :name "Гипотенуза"}
     {:mccme 3456, :name "Hello, Harry!"}
     {:mccme 3461, :name "Последняя цифра"}
     {:mccme 3464, :name "Сумма цифр"}
     {:mccme 3466, :name "Шнурки"}
     {:mccme 3468, :name "Электронные часы - 1"}
     {:mccme 3473, :name "Стоимость покупки"}
     {:mccme 3477, :name "Улитка"}
     {:mccme 3535, :name "Пингвины"}]}
   {:name "Условный оператор, цикл for",
    :problems
    [{:mccme 3501, :name "Максимум двух чисел"}
     {:mccme 3502, :name "Какое число больше?"}
     {:mccme 3504, :name "Високосный год"}
     {:mccme 3505, :name "Максимум трех чисел"}
     {:mccme 3507, :name "Сколько совпадает чисел"}
     {:mccme 3510, :name "Ход короля"}
     {:mccme 3512, :name "Ход ферзя"}
     {:mccme 3513, :name "Ход коня"}
     {:mccme 3514, :name "Шахматная доска"}
     {:mccme 3520, :name "Билеты на метро - 1"}
     {:mccme 3523, :name "Коробки"}
     {:mccme 3526, :name "Котлеты"}
     {:mccme 3528, :name "Ряд - 1"}
     {:mccme 3530, :name "Ряд - 3"}
     {:mccme 3531, :name "Сумма квадратов"}
     {:mccme 3532, :name "Сумма кубов"}
     {:mccme 3534, :name "Число сочетаний"}
     {:mccme 3536, :name "Флаги"}
     {:mccme 3539, :name "Сумма десяти чисел"}
     {:mccme 3540, :name "Сумма N чисел"}
     {:mccme 3544, :name "Замечательные числа - 1"}
     {:mccme 3545, :name "Замечательные числа - 2"}
     {:mccme 3546, :name "Замечательные числа - 3"}
     {:mccme 3548, :name "Замечательные числа - 4"}
     {:mccme 3549, :name "Замечательные числа - 5"}
     {:mccme 3553, :name "Потерянная карточка"}]}
   {:name "Строки и списки",
    :problems
    [{:mccme 3737, :name "Две половинки"}
     {:mccme 3741, :name "Удаление фрагмента"}
     {:mccme 3742, :name "Обращение фрагмента"}
     {:mccme 3743, :name "Дублирование фрагмента"}
     {:mccme 3744, :name "Замена подстроки"}
     {:mccme 3828, :name "Четные индексы"}
     {:mccme 3829, :name "Четные элементы"}
     {:mccme 3832, :name "Соседи одного знака"}
     {:mccme 3833, :name "Больше своих соседей"}
     {:mccme 3834, :name "Наибольший элемент"}
     {:mccme 3837, :name "Шеренга"}
     {:mccme 3838, :name "Количество различных элементов"}
     {:mccme 3843, :name "Переставить min и max"}
     {:mccme 3846, :name "Количество совпадающих пар"}
     {:mccme 3847, :name "Уникальные элементы"}
     {:mccme 3851, :name "Кегельбан"}
     {:mccme 3852, :name "Ферзи"}]}
   {:name "Словари, множества, двумерные массивы",
    :problems
    [{:mccme 3749, :name "Количество различных чисел"}
     {:mccme 3751, :name "Пересечение множеств"}
     {:mccme 3752, :name "Встречалось ли число раньше"}
     {:mccme 3754, :name "Количество слов в тексте"}
     {:mccme 3757, :name "Полиглоты"}
     {:mccme 3760, :name "Словарь синонимов"}
     {:mccme 3762, :name "Самое частое слово"}
     {:mccme 3764, :name "Частотный анализ"}
     {:mccme 3767, :name "Англо-латинский словарь"}
     {:mccme 3769, :name "Продажи (D)"}
     {:mccme 111364, :name "Шахматная доска"}
     {:mccme 111366, :name "Побочная диагональ"}
     {:mccme 111373, :name "Кинотеатр"}
     {:mccme 111377, :name "Ходы ферзя"}
     {:mccme 111385, :name "Сапер"}]}]}]
