[{:id "python",
  :name "Питон",
  :users
  [{:name "Ившина Анна", :mccme 189730}
   {:name "Марданов Сергей", :mccme 207524}
   {:name "Пупышев Иван", :mccme 203178}
   {:name "Рублев Богдан", :mccme 213513}
   {:name "Ивонин Арсений", :mccme 217182}
   {:name "Шушпанов Елисей", :mccme 204110}
   {:name "Помаскин Кирилл", :mccme 221534}
   {:name "Лучинин Сергей", :mccme 227614}],
  :contests
  [{:name "Типы данных, целочисленная арифметика",
    :problems
    [{:mccme 3443, :name "Степень двойки."}
     {:mccme 3444, :name "Факториал."}
     {:mccme 3445, :name "Гипотенуза."}
     {:mccme 3450, :name "Квадрат числа."}
     {:mccme 3451, :name "Корень степени 10."}
     {:mccme 3455, :name "Гипотенуза"}
     {:mccme 3456, :name "Hello, Harry!"}
     {:mccme 3461, :name "Последняя цифра"}
     {:mccme 3464, :name "Сумма цифр"}
     {:mccme 3466, :name "Шнурки"}
     {:mccme 3469, :name "Электронные часы - 2"}
     {:mccme 3473, :name "Стоимость покупки"}
     {:mccme 3477, :name "Улитка"}
     {:mccme 3535, :name "Пингвины"}]}
   {:name "Условный оператор, цикл for",
    :problems
    [{:mccme 3501, :name "Максимум двух чисел"}
     {:mccme 3502, :name "Какое число больше?"}
     {:mccme 3504, :name "Високосный год"}
     {:mccme 3505, :name "Максимум трех чисел"}
     {:mccme 3507, :name "Сколько совпадает чисел"}
     {:mccme 3510, :name "Ход короля"}
     {:mccme 3512, :name "Ход ферзя"}
     {:mccme 3513, :name "Ход коня"}
     {:mccme 3514, :name "Шахматная доска"}
     {:mccme 3520, :name "Билеты на метро - 1"}
     {:mccme 3523, :name "Коробки"}
     {:mccme 3526, :name "Котлеты"}
     {:mccme 3528, :name "Ряд - 1"}
     {:mccme 3530, :name "Ряд - 3"}
     {:mccme 3531, :name "Сумма квадратов"}
     {:mccme 3532, :name "Сумма кубов"}
     {:mccme 3534, :name "Число сочетаний"}
     {:mccme 3536, :name "Флаги"}
     {:mccme 3539, :name "Сумма десяти чисел"}
     {:mccme 3540, :name "Сумма N чисел"}
     {:mccme 3544, :name "Замечательные числа - 1"}
     {:mccme 3545, :name "Замечательные числа - 2"}
     {:mccme 3546, :name "Замечательные числа - 3"}
     {:mccme 3548, :name "Замечательные числа - 4"}
     {:mccme 3549, :name "Замечательные числа - 5"}
     {:mccme 3553, :name "Потерянная карточка"}]}
   {:name "Строки и списки",
    :problems
    [{:mccme 3737, :name "Две половинки"}
     {:mccme 3741, :name "Удаление фрагмента"}
     {:mccme 3742, :name "Обращение фрагмента"}
     {:mccme 3743, :name "Дублирование фрагмента"}
     {:mccme 3744, :name "Замена подстроки"}
     {:mccme 3828, :name "Четные индексы"}
     {:mccme 3829, :name "Четные элементы"}
     {:mccme 3832, :name "Соседи одного знака"}
     {:mccme 3833, :name "Больше своих соседей"}
     {:mccme 3834, :name "Наибольший элемент"}
     {:mccme 3837, :name "Шеренга"}
     {:mccme 3838, :name "Количество различных элементов"}
     {:mccme 3843, :name "Переставить min и max"}
     {:mccme 3846, :name "Количество совпадающих пар"}
     {:mccme 3847, :name "Уникальные элементы"}
     {:mccme 3851, :name "Кегельбан"}
     {:mccme 3852, :name "Ферзи"}]}
   {:name "Функции и рекурсия",
    :problems
    [{:mccme 3790, :name "Минимум 4 чисел"}
     {:mccme 3791, :name "Длина отрезка"}
     {:mccme 3792, :name "Принадлежит ли точка квадрату - 1"}
     {:mccme 3794, :name "Принадлежит ли точка кругу"}
     {:mccme 3797, :name "Сократите дробь"}
     {:mccme 3798, :name "Минимальный делитель числа"}
     {:mccme 3799, :name "Проверка числа на простоту"}
     {:mccme 3801, :name "Сложение без сложения"}
     {:mccme 3804, :name "Сумма последовательности"}
     {:mccme 3805, :name "Разворот последовательности"}
     {:mccme 3808, :name "Ханойские башни"}
     {:mccme 3809, :name "Ремонт в Ханое"}
     {:mccme 3810, :name "Циклические башни"}
     {:mccme 3814, :name "Фишки"}]}
   {:name "Словари, множества, двумерные массивы",
    :problems
    [{:mccme 3749, :name "Количество различных чисел"}
     {:mccme 3751, :name "Пересечение множеств"}
     {:mccme 3752, :name "Встречалось ли число раньше"}
     {:mccme 3754, :name "Количество слов в тексте"}
     {:mccme 3757, :name "Полиглоты"}
     {:mccme 3760, :name "Словарь синонимов"}
     {:mccme 3762, :name "Самое частое слово"}
     {:mccme 3764, :name "Частотный анализ"}
     {:mccme 3767, :name "Англо-латинский словарь"}
     {:mccme 3769, :name "Продажи (D)"}
     {:mccme 111364, :name "Шахматная доска"}
     {:mccme 111366, :name "Побочная диагональ"}
     {:mccme 111373, :name "Кинотеатр"}
     {:mccme 111377, :name "Ходы ферзя"}
     {:mccme 111385, :name "Сапер"}]}
   {:name "Сортировка",
    :problems
    [{:mccme 111152, :name "Возрастает ли список?"}
     {:mccme 111153, :name "Последний максимум"}
     {:mccme 111154, :name "Количество цифр"}
     {:mccme 111155, :name "Противоположные элементы в массиве"}
     {:mccme 111157, :name "Сортировка вставкой"}
     {:mccme 111158, :name "Сортировка пузырьком"}
     {:mccme 111166, :name "Сортировка подсчетом"}
     {:mccme 111159, :name "Создание архива"}
     {:mccme 111160, :name "Обувной магазин"}
     {:mccme 111161, :name "Результаты олимпиады"}
     {:mccme 111162, :name "Такси"}
     {:mccme 111163, :name "Коньки"}
     {:mccme 111164, :name "Чемпионат по стрельбе"}
     {:mccme 111165, :name "SMS-голосование"}]}
   {:name "Файлы",
    :problems
    [{:mccme 111327, :name "Числа могут быть где угодно"}
     {:mccme 111329, :name "Построчное обращение"}
     {:mccme 111330, :name "Обращение всего файла"}
     {:mccme 111331, :name "Длинные строки"}
     {:mccme 111333, :name "Сумма чисел в строках"}
     {:mccme 111334, :name "Сумма чисел в файле"}
     {:mccme 111336, :name "Шифр Цезаря - 2"}
     {:mccme 111337, :name "Максимальный балл по классам"}
     {:mccme 111340, :name "Победитель олимпиады"}
     {:mccme 111344,
      :name "Школы с наибольшим числом участников олимпиады"}
     {:mccme 111347, :name "Отсортировать список участников по баллам"}
     {:mccme 111358, :name "Проходной балл"}]}]}
 {:id "men",
  :name "Тренировки Ф. Меньшикова",
  :accept true
  :users
  [{:name "Сырцев Александр", :mccme 206065}
   {:name "Втюрин Алексей", :mccme 221743}
   {:name "Клёпов Дмитрий", :mccme 217204}
   {:name "Шамов Степан", :mccme 217625}
   {:name "Шушпанов Стефан", :mccme 204109}
   {:name "Фукалов Даниил", :mccme 184493}
   {:name "Санников Илья", :mccme 204550}
   {:name "Лучинин Сергей", :mccme 227614}],
  :contests
  [{:name "Тренировка 1",
    :problems
    [{:mccme 611, :name "Простые числа"}
     {:mccme 612, :name "Выражение"}
     {:mccme 613, :name "Возрастающая подпоследовательность"}
     {:mccme 614, :name "Треугольник и точка"}
     {:mccme 615, :name "Степень"}
     {:mccme 616, :name "Покер"}]}
   {:name "Тренировка 2",
    :problems
    [{:mccme 617, :name "Простые числа(2)"}
     {:mccme 618, :name "Перестановки"}
     {:mccme 619, :name "Маршрут"}
     {:mccme 620, :name "Пересечение отрезков"}
     {:mccme 621, :name "Длинная сумма"}
     {:mccme 622, :name "Спираль"}]}
   {:name "Тренировка 3",
    :problems
    [{:mccme 623, :name "Разложение на простые множители"}
     {:mccme 624, :name "Перестановки(2)"}
     {:mccme 625, :name "Копилка"}
     {:mccme 626, :name "Открытка и конверт"}
     {:mccme 627, :name "Длинное произведение"}
     {:mccme 628, :name "Змейка"}]}
   {:name "Тренировка 4",
    :problems
    [{:mccme 629, :name "Совершенные числа"}
     {:mccme 630, :name "Разложение на слагаемые"}
     {:mccme 631, :name "Гангстеры"}
     {:mccme 632, :name "Площадь многоугольника"}
     {:mccme 633, :name "Деление длинного числа на короткое"}
     {:mccme 634, :name "Скобки"}]}
   {:name "Тренировка 5",
    :problems
    [{:mccme 635, :name "Дружественные числа"}
     {:mccme 636, :name "Скобки(2)"}
     {:mccme 637, :name "Маршрут(2)"}
     {:mccme 638, :name "Выпуклая оболочка - периметр"}
     {:mccme 639, :name "Системы счисления"}
     {:mccme 640, :name "День рождения"}]}
   {:name "Тренировка 6",
    :problems
    [{:mccme 641, :name "Закраска прямой"}
     {:mccme 642, :name "Суммы"}
     {:mccme 535, :name "Игра \"Даты\""}
     {:mccme 645, :name "Lines"}
     {:mccme 646, :name "Покраска лабиринта"}]}
   {:name "Тренировка 7",
    :problems
    [{:mccme 647, :name "Упорядоченные дроби"}
     {:mccme 648, :name "Сообщение"}
     {:mccme 649, :name "Игра умножения"}
     {:mccme 650, :name "Прямая и квадраты"}
     {:mccme 651, :name "Lines(2)"}
     {:mccme 652, :name "Удаление клеток"}]}
   {:name "Тренировка 8",
    :problems
    [{:mccme 653, :name "Несоставляемое число"}
     {:mccme 654, :name "SMS"}
     {:mccme 655, :name "Дерево игры"}
     {:mccme 656, :name "Дуга на сфере"}
     {:mccme 657, :name "Путь коня"}
     {:mccme 658, :name "Грядки"}]}
   {:name "Тренировка 9",
    :problems
    [{:mccme 659, :name "Диалог компьютеров"}
     {:mccme 660, :name "Бросание кубика"}
     {:mccme 661, :name "Игра с монетами"}
     {:mccme 662, :name "Бассейн реки"}
     {:mccme 663, :name "Ближайшее число"}
     {:mccme 664, :name "Прямоугольное деление"}]}
   {:name "Тренировка 10",
    :problems
    [{:mccme 665, :name "Анти-QuickSort"}
     {:mccme 666, :name "Строки Фибоначчи"}
     {:mccme 667, :name "Игра в зачеркивание"}
     {:mccme 668, :name "Граница многоугольника"}
     {:mccme 669, :name "Путь спелеолога"}
     {:mccme 670, :name "Дырявая ткань"}]}
   {:name "Тренировка 11",
    :problems
    [{:mccme 671, :name "Последовательность"}
     {:mccme 672, :name "Провода"}
     {:mccme 673, :name "Палиндромы"}
     {:mccme 674, :name "Круговая площадь"}
     {:mccme 675, :name "Гомер Симпсон"}
     {:mccme 676, :name "Дробная арифметика"}]}
   {:name "Тренировка 12",
    :problems
    [{:mccme 677, :name "Последовательность(2)"}
     {:mccme 678, :name "Гирлянда"}
     {:mccme 679, :name "Головоломка умножения"}
     {:mccme 680, :name "Точки в многоугольнике"}
     {:mccme 681, :name "Водопровод"}
     {:mccme 682, :name "Химические реакции"}]}]}]
