[{:id "n16-python",
  :name "Питон",
  :accept true,
  :users
  [{:name "Бакке Егор, 11", :mccme 193732}
   {:name "Беляев Артем, 10", :mccme 190206}
   {:name "Беркут Кирилл, 10", :mccme 229706}
   {:name "Бибишев Петр, 10", :mccme 188621}
   {:name "Дудина Анастасия, 11", :mccme 188441}
   {:name "Закоулов Илья, 11", :mccme 94596}
   {:name "Зиганшин Марк, 8", :mccme 188014}
   {:name "Мухаметжанова Диана, 10", :mccme 188483}
   {:name "Романов Данил, 11", :mccme 98048}
   {:name "Старцев Михаил, 11", :mccme 224624}
   {:name "Хаустова Ангелина, 9", :mccme 188624}
   {:name "Червяков Сергей, 9", :mccme 241739}
   {:name "Щербаков Роман, 10", :mccme 188627}
   {:name "Яблонских Дамир, 10", :mccme 187968}
   {:name "Яценко Николай, 11", :mccme 48030}
   {:name "Шафран Богдан, 7", :mccme 188384}],
  :contests
  [{:name "Типы данных, целочисленная арифметика",
    :problems
    [{:mccme 3443, :name "Степень двойки."}
     {:mccme 3450, :name "Квадрат числа."}
     {:mccme 3451, :name "Корень степени 10."}
     {:mccme 3456, :name "Hello, Harry!"}
     {:mccme 3461, :name "Последняя цифра"}
     {:mccme 3464, :name "Сумма цифр"}
     {:mccme 3468, :name "Электронные часы - 1"}
     {:mccme 3473, :name "Стоимость покупки"}
     {:mccme 3535, :name "Пингвины"}]}
   {:name "Условный оператор, цикл for",
    :problems
    [{:mccme 3501, :name "Максимум двух чисел"}
     {:mccme 3502, :name "Какое число больше?"}
     {:mccme 3505, :name "Максимум трех чисел"}
     {:mccme 3507, :name "Сколько совпадает чисел"}
     {:mccme 3510, :name "Ход короля"}
     {:mccme 3512, :name "Ход ферзя"}
     {:mccme 3513, :name "Ход коня"}
     {:mccme 3514, :name "Шахматная доска"}
     {:mccme 3528, :name "Ряд - 1"}
     {:mccme 3530, :name "Ряд - 3"}
     {:mccme 3531, :name "Сумма квадратов"}
     {:mccme 3532, :name "Сумма кубов"}
     {:mccme 3536, :name "Флаги"}
     {:mccme 3539, :name "Сумма десяти чисел"}
     {:mccme 3540, :name "Сумма N чисел"}
     {:mccme 3544, :name "Замечательные числа - 1"}
     {:mccme 3546, :name "Замечательные числа - 3"}
     {:mccme 3549, :name "Замечательные числа - 5"}]}
   {:name "Строки и списки",
    :problems
    [{:mccme 3737, :name "Две половинки"}
     {:mccme 3741, :name "Удаление фрагмента"}
     {:mccme 3742, :name "Обращение фрагмента"}
     {:mccme 3743, :name "Дублирование фрагмента"}
     {:mccme 3828, :name "Четные индексы"}
     {:mccme 3829, :name "Четные элементы"}
     {:mccme 3832, :name "Соседи одного знака"}
     {:mccme 3833, :name "Больше своих соседей"}
     {:mccme 3834, :name "Наибольший элемент"}
     {:mccme 3837, :name "Шеренга"}
     {:mccme 3838, :name "Количество различных элементов"}
     {:mccme 3843, :name "Переставить min и max"}
     {:mccme 3846, :name "Количество совпадающих пар"}
     {:mccme 3847, :name "Уникальные элементы"}
     {:mccme 3851, :name "Кегельбан"}
     {:mccme 3852, :name "Ферзи"}]}
   {:name "Словари, множества, двумерные массивы",
    :problems
    [{:mccme 3749, :name "Количество различных чисел"}
     {:mccme 3752, :name "Встречалось ли число раньше"}
     {:mccme 3754, :name "Количество слов в тексте"}
     {:mccme 3757, :name "Полиглоты"}
     {:mccme 3760, :name "Словарь синонимов"}
     {:mccme 3762, :name "Самое частое слово"}
     {:mccme 3764, :name "Частотный анализ"}
     {:mccme 3767, :name "Англо-латинский словарь"}
     {:mccme 3769, :name "Продажи (D)"}
     {:mccme 111364, :name "Шахматная доска"}
     {:mccme 111366, :name "Побочная диагональ"}
     {:mccme 111373, :name "Кинотеатр"}
     {:mccme 111377, :name "Ходы ферзя"}
     {:mccme 111385, :name "Сапер"}]}]}
 {:id "n16-algo",
  :name "Алгоритмы",
  :accept true,
  :users
  [{:name "Бакке Егор, 11", :mccme 193732}
   {:name "Беляев Артем, 10", :mccme 190206}
   {:name "Беркут Кирилл, 10", :mccme 229706}
   {:name "Бибишев Петр, 10", :mccme 188621}
   {:name "Дудина Анастасия, 11", :mccme 188441}
   {:name "Закоулов Илья, 11", :mccme 94596}
   {:name "Зиганшин Марк, 8", :mccme 188014}
   {:name "Мухаметжанова Диана, 10", :mccme 188483}
   {:name "Романов Данил, 11", :mccme 98048}
   {:name "Старцев Михаил, 11", :mccme 224624}
   {:name "Хаустова Ангелина, 9", :mccme 188624}
   {:name "Червяков Сергей, 9", :mccme 241739}
   {:name "Щербаков Роман, 10", :mccme 188627}
   {:name "Яблонских Дамир, 10", :mccme 187968}
   {:name "Яценко Николай, 11", :mccme 48030}
   {:name "Шафран Богдан, 7", :mccme 188384}],
  :contests
  [{:name "Сортировка",
    :problems
    [{:mccme 3334, :name "Проходной балл"}
     {:mccme 581, :name "Гражданская оборона"}
     {:mccme 994, :name "Сплоченная команда "}
     {:mccme 112542, :name "Точки и отрезки"}
     {:mccme 1216, :name "*Школа танцев"}
     {:mccme 3721, :name "**Кассы"}]}]}]
